"""Задача №17. Дан список чисел. Определите, сколько в нем
встречается различных чисел.
Input: [1, 1, 2, 0, -1, 3, 4, 4]
Output: 6
Примечание: Пользователь может вводить значения
списка или список задан изначально.
"""

list_1 = [1, 1, 2, 0, -1, 3, 3, 5, 6, 4, 4]
plenty_1 = set(list_1)
print(len(plenty_1))


